#5.1 Прочитати два числа та: 
#    • вивести значення бiльшого iз них; 
#    • вивести словами, чи перше було бiльше, чи друге, чи вони рiвнi.
#5.2 Вивести бiльше iз введених 5 чисел.
#5.3 Читати з клавiатури числа, поки не ввели лiтеру ‘x’. Вивести: 
#    • найбiльше, 
#    • найменше, 
#    • суму, 
#    • кiлькiсть парних, 
#    • кiлькiсть додатних.
#P.S. Програма повинна коректно працювати,  навіть коли введено лише вiд’ємнi числа. При запуску аплікації має бути вибір яку з 3 операцій ми хочемо виконати (5.1, 5.2, 5.3).

def input_numbers(n = None):
    nums = list()
    if n != None:
        count = 0
        while count < n:
            nums.append(int(input()))
            count += 1
    else:
        
        while True:
            a = input()
            if a == 'x':
                break
            nums.append(int(a))               
    print(nums)
            

    
input_numbers(2) 
input_numbers(5)
input_numbers()
        